//======================================================================================================
//    LibreConver Lite v1.007 MQL4/5 HTML-Csv Converter Script 
//    Главный модуль обработки событий
//    Librecoin(c)2015-2017      
//======================================================================================================
//    REVIEWS
//======================================================================================================
//    Конвертер HTML файлов для календаря экономических событий
//    Строго рекомендовано устанавливать в календарях время UTC с учетом перехода на зимнее время.
//    Конвертирует выгрузку из:
//    1. http://www.investing.com/economic-calendar
//       Выгрузка через сохренение страницы из браузера (парсинг).
//       Выгрузка должна распологаться в общей common "песочнице" терминала
//       Доработано 2016.04.16 изменен тег времени события
//======================================================================================================
//    IDEAS 
//======================================================================================================
//----- Важно!!!
//----- Задуманные
//----- В работе
//----- Выполненные
//======================================================================================================
//    PROPERTY
//======================================================================================================
#property copyright "Librecoin(c)2015-2017"
#property link      "https://www.mql5.com/ru/users/kirillovyv"
#property strict
#property   description   "************************************************"
#property   description   "  HTML-CSV Converter Script LiBRECONVER v1.007" 
#property   description   "  From Russia with Love!  :-)"
#property   description   "  https://www.mql5.com/ru/users/kirillovyv"
#property   description   "************************************************"
#property version   "1.007"
input    string   Sid   =  "LiBRECONVER LITE v1.007";         //Set Identifier
const    string   vers  =  "LiBRECONVER LITE v1.007";         //Version
#property strict
#property script_show_inputs
//======================================================================================================
//    INCLUDE
//------------------------------------------------------------------------------------------------------
//----- Определения переменных и структур
   #include <LC_Def_0_v1.107_L.mqh>        //Определения переменных и структур MQL4/5
//----- Интерфейс настроек
   #include <LC_Int_0_v1.107_L.mqh>        //Интерфейс настроек MQL4/5
////----- Главный алгоритм
#ifdef __MQL5__
   #include <LC_Man_5_v1.107_L.mqh>        //Главный алгоритм MQL5
#else
   #ifdef __MQL4__
      #include <LC_Man_4_v1.107.mqh>       //Главный алгоритм MQL4
   #endif
#endif
#ifdef __MQL5__
   #include <LC_Fun1_5_v1.107_L.mqh>         //Основные функции алгортма MQL5(Traling,Open-Close,MA,CalcSR)
#else
   #ifdef __MQL4__
      #include <LC_Fun1_4_v1.107.mqh>      //Основные функции алгортма MQL4(Traling,Open-Close,MA,CalcSR)
   #endif
#endif
   #include <LC_Fun1_0_v1.107_L.mqh>         //Основные функции алгортма MQL4/5
//======================================================================================================
//    OnStart() - Script program start function                                    
//======================================================================================================
void OnStart(){
   On_Start();
}//OnStart()
