//+------------------------------------------------------------------+
//|                                                 ge_VKKeyCode.mq4 |
//|                                        Copyright © 2008, ver 1.0 |
//|                                                         Forte928 |
//+------------------------------------------------------------------+
#property copyright "Forte928"
#property link      ""
//#property library

#define VK_BACKSPACE	0x08 
#define VK_TAB			0x09 
#define VK_ENTER		0x0D 
#define VK_SHIFT		0x10 
#define VK_CONTROL	0x11 
#define VK_ALT			0x12 
#define VK_PAUSE		0x13 
#define VK_CAPS_LOCK	0x14 
#define VK_ESCAPE		0x1B 
#define VK_SPACE		0x20 
#define VK_PAGEUP		0x21 
#define VK_PAGEDOWN	0x22 
#define VK_END			0x23 
#define VK_HOME		0x24 
#define VK_LEFT		0x25 
#define VK_UP			0x26 
#define VK_RIGHT		0x27 
#define VK_DOWN		0x28 
#define VK_INSERT		0x2D 
#define VK_DELETE		0x2E 
/*
#include <WinUser32.mqh>
	int HandlWindow=WindowHandle(iSymbol,iPeriod);        
	PostMessageA (HandlWindow, WM_COMMAND, 33324, 0); // Обновляем окно.

33017 - снять автопрокрутку
33018 - переключение на представление "бары"
33019 - переключение на представление "свечи"
33021 - сетка Ctrl+G
33022 - переключение на представление "линия"
33023 - смещение графика
33024 - объемы Ctrl+L
33025 - увеличить масштаб
33026 - уменьшить масштаб
33054 - сохранить как рисунок
33134 - таймфрейм D1
33136 - таймфрейм Н4
33137 - таймфрейм М1
33138 - таймфрейм М5
33139 - таймфрейм М15
33140 - таймфрейм М30
33141 - таймфрейм W1
33157 - свойства F8
33220 - графики-шаблон-сохранить шаблон
33230 - вставка-стрелка вниз
33231 - вставка-стрелка вверх
33232 - значки-галочка
33233 - перекрестие
33234 - курсор
33235 - вставка-цикличные линии
33236 - равноудаленный канал
33237 - линии Фибоначчи
33238 - вставка-Фибоначчи-дуги
33239 - вставка-Фибоначчи-веер
33240 - вставка-каналы-Фибоначчи
33241 - вставка-Ганн-сетка Ганна
33242 - вставка-Ганн-линия Ганна
33243 - вставка-Ганн-веер Ганна
33244 - горизонтальная линия
33246 - вставка вилы Эндрюса
33247 - вставка-фигуры-прямоугольник
33248 - вставка-каналы-линейная регрессия
33251 - вставка-значки-стоп
33253 - текст
33254 - вставка-значки-плохо
33255 - вставка-значки-хорошо
33256 - вставка-Фибоначчи-временные зоны
33257 - трендовая линия
33258 - вставка-линии-трендовая линия по углу
33259 - вставка-фигуры-треугольник
33260 - вертикальная линия
33261 - текстовая метка
33315 - вид-тестер стратегий?
33324 - Обновляем окно.
33334 - таймфрейм MN
34300-34699(?) - пользовательские индикаторы в алфавитном порядке
34700 - индикаторы-moving average of oscillator
34701 - индикаторы-accelerator oscillator
34702 - индикаторы-accumulation/distribution 
34703 - индикаторы-alligator
34704 - индикаторы-average directional movement index
34705 - индикаторы-average true range
34706 - индикаторы-awesome oscillator
34707 - индикаторы-bears power
34708 - индикаторы-bollinger bands
34709 - индикаторы-bulls power
34710 - индикаторы-commodity channel index
34711 - индикаторы-demarker
34712 - индикаторы-envelopes
34713 - индикаторы-force index
34714 - индикаторы-fractals
34715 - индикаторы-gator oscillator
34716 - индикаторы-ichimoku kinko hyo
34717 - индикаторы-macd
34718 - индикаторы-market facilitation index
34719 - индикаторы-momentum
34720 - индикаторы-money flow index
34721 - индикаторы-moving averages
34722 - индикаторы-on balance volume
34723 - индикаторы-parabolic sar
34724 - индикаторы-relative strength index
34725 - индикаторы-relative vigor index
34726 - индикаторы-standard deviation
34727 - индикаторы-stochastic oscillator
34728 - индикаторы-volumes
34729 - индикаторы-william's percent range
35400 - таймфрейм H1
35454 - ордер buylimit
35455 - ордер buystop
35456 - ордер selllimit
35457 - ордер sellstop
35458 - новый ордер F9
35464 - правая ценовая метка
35511 - графики-шаблоны-загрузить шаблон
57602 - закрыть текущий график
*/
//+------------------------------------------------------------------------------------------+