//+------------------------------------------------------------------+
//|                                                      pattern.mq5 |
//|                                  PATTERN: Abstract trading robot |
//|                           Copyright 2017, Sergey Pavlov (DC2008) |
//|                             https://www.mql5.com/ru/users/dc2008 |
//+------------------------------------------------------------------+
#property copyright     "Copyright 2017, Sergey Pavlov (DC2008)"
#property link          "https://www.mql5.com/ru/users/dc2008"
#property version       "1.00"
#property description   "Абстрактный торговый робот - паттерн ООП"
//+------------------------------------------------------------------+
//| Структура направления торговли                                   |
//+------------------------------------------------------------------+
struct sDirection
  {
   bool              Buy;     // покупаем
   bool              Sell;    // продаём
  };
//+------------------------------------------------------------------+
//| Абстрактная модель управления капиталом                          |
//+------------------------------------------------------------------+
interface AMM
  {
//--- расчёт размера лота
   double Lots();
//--- методы интерфейса по умолчанию имеют public-доступ 
  };
//+------------------------------------------------------------------+
//| Абстрактный сигнал                                               |
//+------------------------------------------------------------------+
interface ASignal
  {
//--- генерировать сигналы (запустить генератор сигналов)
   sDirection Generator();
//--- методы интерфейса по умолчанию имеют public-доступ 
  };
//+------------------------------------------------------------------+
//| Абстрактный торговый запрос                                      |
//+------------------------------------------------------------------+
interface ARequest
  {
//--- отправить торговый запрос
   bool Request(const double lot,sDirection &direct);
//--- методы интерфейса по умолчанию имеют public-доступ 
  };
//+------------------------------------------------------------------+
//| Абстрактное сопровождение позиции                                |
//+------------------------------------------------------------------+
interface ASupport
  {
//--- сопровождать открытую позицию
   void Support();
//--- методы интерфейса по умолчанию имеют public-доступ 
  };
//+------------------------------------------------------------------+
//| Абстрактная (модель) стратегия торгового робота                  |
//+------------------------------------------------------------------+
interface AStrategy
  {
//--- Абстрактная стратегия умеет управлять капиталом
   AMM      *MoneyManagement();

//--- Абстрактная стратегия умеет генерировать торговые сигналы 
   ASignal  *CreateSignal();

//--- Абстрактная стратегия умеет отправлять торговые запросы
   ARequest *TradeRequest();

//--- Абстрактная стратегия умеет сопровождать открытую позицию 
   ASupport *PositionSupport();

//--- Абстрактная метод обработки события OnInit()
   int  OnInitStrategy();

//--- Абстрактная метод обработки события OnTick()
   void OnTickStrategy();

//--- Абстрактная метод обработки события OnDeinit()
   void OnDeinitStrategy(const int reason);

//--- Абстрактная метод обработки события OnTrade()
   void OnTradeStrategy();
  };
//+------------------------------------------------------------------+
//| Объём сделки отвечает спецификации AMM                           |
//+------------------------------------------------------------------+
class CVolume : public AMM
  {
private:
   double            m_lot;
public:
   //--- расчёт размера лота
   double Lots() {Print("Объём сделки расчитан"); return m_lot;}

                     CVolume( void ) {Print("Создана модель расчёта лота");}
                    ~CVolume( void ) {Print("Уничтожена модель расчёта лота");}
  };
//+------------------------------------------------------------------+
//| Торговый сигнал отвечает спецификации ASignal                    |
//+------------------------------------------------------------------+
class CSignal : public ASignal
  {
private:
   sDirection        m_signal;
public:
   //--- генерировать сигналы (запустить генератор сигналов)
   sDirection        Generator() {Print("Поиск торгового сигнала"); return m_signal;}

                     CSignal( void ) {Print("Создан генератор торговых сигналов");}
                    ~CSignal( void ) {Print("Уничтожен генератор торговых сигналов");}
  };
//+------------------------------------------------------------------+
//| Торговый запрос отвечает спецификации ARequest                   |
//+------------------------------------------------------------------+
class CRequest : public ARequest
  {
private:
   bool              m_request;
public:
   //--- отправлять торговый запрос
   bool Request(const double lot,sDirection &direct) {Print("Торговый запрос отправлен"); return m_request;}

                     CRequest( void ) {Print("Создана модель торговых запросов");}
                    ~CRequest( void ) {Print("Уничтожена модель торговых запросов");}
  };
//+------------------------------------------------------------------+
//| Сопровождение позиции отвечает спецификации ASupport             |
//+------------------------------------------------------------------+
class CSupport : public ASupport
  {
public:
   //--- сопровождать открытую позицию
   void Support() {Print("Сопровождаем торговую позицию");}

                     CSupport( void ) {Print("Создана модель сопровождения позиции");}
                    ~CSupport( void ) {Print("Уничтожена модель сопровождения позиции");}
  };
//+------------------------------------------------------------------+
//| Торговый советник отвечает спецификации AStrategy                |
//+------------------------------------------------------------------+
class CStrategy : public AStrategy
  {
public:
   //--- стратегия умеет управлять капиталом
   AMM      *MoneyManagement()
     {return new CVolume();}

   //--- стратегия умеет генерировать торговые сигналы 
   ASignal  *CreateSignal()
     {return new CSignal();}

   //--- стратегия умеет отправлять торговые запросы
   ARequest *TradeRequest()
     {return new CRequest();}

   //--- стратегия умеет сопровождать открытую позицию 
   ASupport *PositionSupport()
     {return new CSupport();}

   //--- метод обработки события OnInit()
   int  OnInitStrategy()
     {Print("Получено событие OnInit()"); return(INIT_SUCCEEDED);}

   //--- метод обработки события OnTick()
   void OnTickStrategy()
     {Print("Получено событие OnTick()");}

   //--- метод обработки события OnDeinit()
   void OnDeinitStrategy(const int reason)
     {Print("Получено событие OnDeinit()");}

   //--- метод обработки события OnTrade()
   void OnTradeStrategy()
     {Print("Получено событие OnTrade()");}

                     CStrategy(void) {Print("Создан торговый советник");}
                    ~CStrategy(void) {Print("Уничтожен торговый советник");}
  };
//+------------------------------------------------------------------+
//| Конфигуратор торговой стратегии                                  |
//+------------------------------------------------------------------+
class CConfigurator
  {
private:
   AStrategy        *strategy;
   AMM              *trade_volume;
   ASignal          *trade_signal;
   ARequest         *trade_Request;
   ASupport         *trade_Support;

   sDirection        m_buy_or_sell;
   double            m_volume;
public:
   int Init()
     {
      //--- трансляция события OnInit()
      strategy.OnInitStrategy();
      //---
      return(INIT_SUCCEEDED);
     }
   void Tick()
     {
      //--- трансляция события OnTick()
      strategy.OnTickStrategy();
      //--- расчёт размера лота
      m_volume=trade_volume.Lots();
      //--- генерировать сигналы
      m_buy_or_sell=trade_signal.Generator();
      //--- отправить торговый запрос
      trade_Request.Request(m_volume,m_buy_or_sell);
      //--- сопровождать открытую позицию
      trade_Support.Support();
     }
   void Trade()
     {
      //--- трансляция события OnTrade()
      strategy.OnTradeStrategy();
     }
   void Deinit(const int reason)
     {
      //--- трансляция события OnDeinit()
      strategy.OnDeinitStrategy(reason);
     }
   void CConfigurator(void)
     {
      //--- создаём объект торговой стратегии 
      strategy=new CStrategy();
      //--- создаём объекты модулей робота
      trade_volume   =strategy.MoneyManagement();
      trade_signal   =strategy.CreateSignal();
      trade_Request  =strategy.TradeRequest();
      trade_Support  =strategy.PositionSupport();
     }
   void ~CConfigurator(void)
     {
      //--- уничтожаем созданные объекты
      delete trade_volume;
      delete trade_signal;
      delete trade_Request;
      delete trade_Support;
      delete strategy;
     }
  };

CConfigurator expert;
//+------------------------------------------------------------------+
//| Expert initialization function                                   |
//+------------------------------------------------------------------+
int OnInit()
  {
   expert.Init();
   return(INIT_SUCCEEDED);
  }
//+------------------------------------------------------------------+
//| Expert tick function                                             |
//+------------------------------------------------------------------+
void OnTick()
  {
   expert.Tick();
  }
//+------------------------------------------------------------------+
//| Trade function                                                   |
//+------------------------------------------------------------------+
void OnTrade()
  {
   expert.Trade();
  }
//+------------------------------------------------------------------+
//| Expert deinitialization function                                 |
//+------------------------------------------------------------------+
void OnDeinit(const int reason)
  {
   expert.Deinit(reason);
  }
//+------------------------------------------------------------------+

// Сообщения Абстрактного торгового робота

//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Создан торговый советник
//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Создана модель расчёта лота
//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Создан генератор торговых сигналов
//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Создана модель торговых запросов
//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Создана модель сопровождения позиции
//2017.10.23 13:47:20.284	pattern (USDJPY,M1)	Получено событие OnInit()
//2017.10.23 13:47:29.156	pattern (USDJPY,M1)	Получено событие OnTick()
//2017.10.23 13:47:29.156	pattern (USDJPY,M1)	Объём сделки расчитан
//2017.10.23 13:47:29.156	pattern (USDJPY,M1)	Поиск торгового сигнала
//2017.10.23 13:47:29.156	pattern (USDJPY,M1)	Торговый запрос отправлен
//2017.10.23 13:47:29.156	pattern (USDJPY,M1)	Сопровождаем торговую позицию
//...
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Получено событие OnDeinit()
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Уничтожена модель расчёта лота
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Уничтожен генератор торговых сигналов
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Уничтожена модель торговых запросов
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Уничтожена модель сопровождения позиции
//2017.10.23 13:47:30.256	pattern (USDJPY,M1)	Уничтожен торговый советник
