//+------------------------------------------------------------------+
//|                                                 AnalizTrenda.mq4 |
//|                                                     Yuriy Tokman |
//|                                            yuriytokman@gmail.com |
//+------------------------------------------------------------------+
#property copyright "Yuriy Tokman"
#property link      "yuriytokman@gmail.com"

//+------------------------------------------------------------------+
//| script program start function                                    |
//+------------------------------------------------------------------+
int start()
  {
//----
  double a=Low[0]+(High[0]-Low[0])/2; //середина текущего бара:
  
  if(a>High[1])                       //1.находиться выше пика предыдущего бара
  
   MessageBox("+ Тренд направлен в вверх ","Направление тренда");
   
  if(a<Low[1])                        //2.ниже ценового диапазона предыдущего бара
  
   MessageBox("- Тренд направлен в низ ","Направление тренда");
   
  if((a<=High[1])&&(a>=Low[1]))       //3.внутри ценового интервала предыдущего бара
  
   MessageBox("0 Перекрытие с неясным трендом ","Направление тренда");  
//----
   return(0);
  }
//+------------------------------------------------------------------+