//+------------------------------------------------------------------+  
//|                                               ToClearComment.mq5 | 
//|                               Copyright © 2017, Nikolay Kositsin | 
//|                              Khabarovsk,   farria@mail.redcom.ru | 
//+------------------------------------------------------------------+  
#property copyright "Copyright © 2017, Nikolay Kositsin"
#property link "farria@mail.redcom.ru"
#property description "Скрипт очищает график от комметария, который располагается в левом верхнем углу"
#property script_show_confirm //потверждение действия скрипта трейдером


//+------------------------------------------------------------------+ 
//| start function                                                   |
//+------------------------------------------------------------------+
void OnStart()
  {
//---- Удаление комментария с текущего графика
   Comment("");
//----
  }
//+------------------------------------------------------------------+
