//+------------------------------------------------------------------+
//|                                                vusual_start .mq4 |
//|                                             Copyright © 2007, AP |
//|                                                   ekr-ap@mail.ru |
//|                                          Aleksandr Pak, Alma-Ata |
//+------------------------------------------------------------------+
//
// Вставить в теструемый индикатор, 

  //..................................................................
   //....... Это вcтавленный код для визуального тестирования индикатора 
   /**/  int start,start_j;
   /**/start_j=ObjectGet("start",OBJPROP_TIME1);     
   /**/if(GetLastError()==0) start=iBarShift(NULL,0,start_j,False); else start=0;
   //................конец кода 
   //.....................................................................
  
  // найти начало цикла и присвоить старт
 // например:
 // было for(i=0; i<limit;i++) стало => for(i=start; i<limit;i++)